{
  "dashboard-logs": {
    "titulo": "Dashboard de Análisis de Logs Web",
    "contexto": "Este proyecto fue desarrollado como parte de una asignatura de la carrera de Ciencia de Datos en equipo. La idea principal fue crear un dashboard interactivo para visualizar los registros (logs) de un servidor web, implementando un proceso ETL para transformar los datos y poder visualizarlos.",
    "desafio": "Transformar logs de un servidor web en información clara y accesible mediante un dashboard interactivo.",
    "aporte": "Participé en el diseño e implementación de un Data Warehouse en PostgreSQL, desarrollé un proceso ETL en Python optimizado con logging para monitoreo, y monté toda la infraestructura en un servidor Debian 12 propio (al cual accedía de forma remota con Tailscale VPN), utilizando Docker compose, Jupyter Notebook, pgweb, PostgreSQL y Grafana. Para que mi equipo acceda remotamente utilicé Cloudflared Tunnel.",
    "resultado": "Obtuvimos un dashboard en Grafana conectado a la base de datos, que permite visualizar métricas importantes del servidor con distintos gráficos interactivos.",
    "aprendizaje": "Profundicé en el proceso de ETL al implementar técnicas de chunks y logging, en la administración de entornos productivos con contenedores y en el desarrollo en equipo.",
    "tecnologias": [
      "Python",
      "PostgreSQL",
      "Docker",
      "Grafana",
      "Jupyter Notebook",
      "pgweb",
      "Linux",
      "Tailscale",
      "Cloudflared"
    ],
    "visualizaciones": [
      "assets/proyectos/dash-2.png",
      "assets/proyectos/dash-3.png",
      "assets/proyectos/diagrama_kimball.png",
      "assets/proyectos/arquitectura-docker.png"
    ],
    "github": "https://github.com/Adrielthu/Dashboard_Logs"
  },
  "gis-salta": {
    "titulo": "Análisis Geoespacial de Salta Capital",
    "contexto": "Este proyecto lo hice como parte de una práctica académica relacionada a Fundación Sadosky para estudiar la propagación de la tuberculosis en Salta Capital, el cual es un problema de sanidad a nivel nacional porque cuenta con altas tasas de incidencia.",
    "desafio": "En principio se me presentaron varios desafíos, el principal fue aprender a manejar las herramientas para datos geoespaciales y QGIS, y el otro fue adaptar un script que ya existía (pero diseñado para otra provincia) a Salta Capital, esto me obligó a estudiar en profundidad qué hacía el script y cómo poder aplicar las mejores prácticas para no solo cumplir con el objetivo, sino también mejorar la calidad del resultado.",
    "aporte": "Ademas de adaptar el script para que funcione en Salta, implementé librerías específicas para manejar datos geoespaciales ya que antes no se utilizaban, y eran necesarias para simplificar el proceso, sumé datos reales que antes se generaban con el script, lo cual ayudó a mejorar la precisión de los análisis posteriores, y por último, desarrollé un modelo de machine learning para dar solución rápida y automática a un problema en la obtención manual de datos.",
    "resultado": "Generé dos capas GIS: una con las viviendas (datos reales integrados) e indicadores socioeconómicos, y otra con puntos de interés urbanos (restaurantes, gimnasios, hospitales, etc). Este resultado fue muy importante ya que permitió dar mayor realismo a la simulación de cómo se propagaría la tuberculosis en ciertos escenarios o en un futuro.",
    "aprendizaje": "Aprendí a manejar datos geoespaciales y a utilizar herramientas como QGIS y GeoPandas, además mejoré mis habilidades de comunicación al tener que explicar conceptos técnicos a personas sin conocimientos en el área.",
    "tecnologias": [
      "Python",
      "QGIS",
      "GeoPandas",
      "Google Places API",
      "TensorFlow"
    ],
    "visualizaciones": [
      "assets/proyectos/GIS-1.png",
      "assets/proyectos/GIS-2.png",
      "assets/proyectos/GIS-3.jpg"
    ],
    "github": "https://github.com/Adrielthu/Capa_GIS_Salta"
  },
  "reglas-de-asociacion": {
    "titulo": "Análisis de comportamiento de clientes en una E-Shop Polaca",
    "contexto": "Realicé un análisis de patrones para entender cómo se comporta y navega el usuario en una e-shop polaca. El objetivo fue encontrar recomendaciones basadas en reglas de asociación y secuencias de navegación utilizando Minería de Datos, para optimizar la estrategia comercial y la experiencia del cliente.",
    "desafio": "Lo más desafiante fue implementar un algoritmo de Minería que de un buen resultado, en este caso fue a prueba y error, probando distintos parámetros hasta encontrar la combinación que de mejor resultado.",
    "aporte": "No solo identifiqué productos importantes y patrones de navegación, lo cual permitiría implementar un sistema de recomendaciones personalizadas para los usuarios, similar a como lo hace Mercado Libre, sinó que también propuse mejoras en cuanto a la reubicación de los productos, ya que me di cuenta de que no se podrían colocar en posiciones estratégicas para que más usuarios hicieran click, esto lo podemos ver en el gráfico del principio.",
    "resultado": "Como resultado obtuve una lista de los productos más importantes, reglas de asociación entre productos y patrones de navegación comunes. Pueden ser utilizados para mejorar la experiencia del usuario y optimizar la estrategia comercial de la e-shop.",
    "aprendizaje": "Aprendí a aplicar técnicas de minería de datos para obtener información que no se puede ver a simple vista.",
    "tecnologias": [
      "R",
      "Rstudio",
      "arules",
      "Spade",
      "git"
    ],
    "visualizaciones": [
      "assets/proyectos/reglas-asociacion.png",
      "assets/proyectos/secuencias.png",
      "assets/proyectos/heatmap_polonia.jpg",
      "assets/proyectos/conclusion-arules.png"
    ],
    "github": "https://github.com/Adrielthu/Association_Rule"
  },
  "educacion-federacion": {
    "titulo": "Diagnóstico Educativo en Federación, Entre Ríos",
    "contexto": "",
    "desafio": "El principal desafío fue trabajar con una base de datos real que presentaba varios problemas, como datos faltantes, inconsistencias y falta de normalización. Además, tuve que seleccionar las variables más relevantes para el análisis y decidir qué métodos estadísticos utilizar para obtener conclusiones significativas.",
    "aporte": "Realicé un análisis exhaustivo de los datos, aplicando técnicas de limpieza y transformación para abordar los problemas identificados. Utilicé métodos estadísticos para obtener conclusiones significativas y visualicé los resultados de manera efectiva.",
    "resultado": "El análisis permitió identificar fortalezas y debilidades en el sistema educativo de Federación, Entre Ríos. Se detectaron disparidades entre escuelas públicas y privadas, diferencias en el rendimiento",
    "aprendizaje": "Aprendí a manejar y limpiar datos reales, aplicar técnicas estadísticas y de visualización para comunicar resultados de manera efectiva. También mejoré mis habilidades en R y en el uso de librerías como ggplot2 y plotly para crear gráficos interactivos.",
    "tecnologias": [
      "R",
      "plotly",
      "ggplot2",
      "corrplot",
      "ppcor"
    ],
    "visualizaciones": [
      "assets/proyectos/Educacion_1.png",
      "assets/proyectos/Educacion_2.png",
      "assets/proyectos/Educacion_3.png"
    ]
  }
}
